## Final Project Submission

Please fill out:
* Student name: Stacy Kiriiri
* Student pace: Part time
* Scheduled project review date/time: 24th July 2023
* Instructor name: Asha Deen
* Blog post URL:

## Microsoft-Movie-Analysis
Here, I'm going to do an exploratory data analysis on various datasets to extract insights and identify trends in the movie production industry for Microsoft.

## Accessing the Data with Pandas

In [1]:
#importing the necessary libraries
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
#load the datasets
#first dataframe
df = pd.read_csv('zippedData/imdb.title.basics.csv.gz')
df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [3]:
#second dataframe
df1 = pd.read_csv('zippedData/imdb.title.ratings.csv.gz')
df1.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [4]:
#third dataframe
df2 = pd.read_csv('zippedData/bom.movie_gross.csv.gz')
df2.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

## Methods and Attributes to access data information

In [5]:
#concise summary of the dataframes
#first dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [6]:
#second dataframe
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [7]:
#third dataframe
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [8]:
#first dataframe
df.columns

Index(['tconst', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')

In [9]:
#second dataframe
df1.columns

Index(['tconst', 'averagerating', 'numvotes'], dtype='object')

In [10]:
#third dataframe
df2.columns

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [11]:
#return data types of all columns in the dataframes
#first dataframe
df.dtypes

tconst              object
primary_title       object
original_title      object
start_year           int64
runtime_minutes    float64
genres              object
dtype: object

In [12]:
#second dataframe
df1.dtypes

tconst            object
averagerating    float64
numvotes           int64
dtype: object

In [13]:
#third dataframe
df2.dtypes

title              object
studio             object
domestic_gross    float64
foreign_gross      object
year                int64
dtype: object

In [14]:
#first dataframe
df.shape

(146144, 6)

In [15]:
#second dataframe
df1.shape

(73856, 3)

In [16]:
#third dataframe
df2.shape

(3387, 5)

## Statistical Methods

In [17]:
#summary statistic for the dataframes
#second dataframe
df1.describe()

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [18]:
#third dataframe
df2.describe()

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [19]:
#investigating why the column 'foreign_gross' in df2 statistics has not been calculated
df2['foreign_gross'].sample(n=20)

202      4000000
2644         NaN
1595     6300000
2760     1,010.0
1724         NaN
2240         NaN
1726     1200000
1201    48800000
886      5800000
568      2600000
845      8700000
1334         NaN
2258         NaN
1713         NaN
892     11600000
810     28100000
833          NaN
819     14400000
3249         NaN
1754         NaN
Name: foreign_gross, dtype: object

In [20]:
#checking for missing values in df2
df2.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

## Dealing with missing data

In [21]:
#looking out for missing data in the dataframes
#first dataframe
df.isna().sum()

tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [22]:
#second dataframe
df1.isna().sum()

tconst           0
averagerating    0
numvotes         0
dtype: int64

In [23]:
#third dataframe
df2.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [24]:
#determining the percentage of rows in the 'runtime_minutes' column in df(the first dataframe) that contain missing values
print(len(df[df.runtime_minutes.isna()])/ len(df))

0.21717620976571053

In [25]:
#dropping the column 'runtime_minutes' in df as it will have no impact in my analysis
#first dataframe
df=df.drop("runtime_minutes", axis=1)
df.head()

,tconst,primary_title,original_title,start_year,genres
0,tt0063540,Sunghursh,Sunghursh,2013,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,"Comedy,Drama,Fantasy"

In [26]:
#first dataframe
df.isna().sum()

tconst               0
primary_title        0
original_title      21
start_year           0
genres            5408
dtype: int64

In [27]:
#dropping the remaining missing values from the first dataframe by dropping rows
df = df.dropna()
df

,tconst,primary_title,original_title,start_year,genres
0,tt0063540,Sunghursh,Sunghursh,2013,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,"Comedy,Drama,Fantasy"
...,...,...,...,...,...
146138,tt9916428,The Secret of China,The Secret of China,2019,"Adventure,History,War"
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,Comedy
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,Documentary

In [28]:
#first dataframe
df.isna().sum()

tconst            0
primary_title     0
original_title    0
start_year        0
genres            0
dtype: int64

In [29]:
#second dataframe
df1.isna().sum()

tconst           0
averagerating    0
numvotes         0
dtype: int64

In [30]:
#third dataframe
df2.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [31]:
#determining the percentage of rows in the 'foreign_gross' column in df2(the third dataframe) that contain missing values
print(len(df2[df2.foreign_gross.isna()])/ len(df2))

0.3985828166519043

In [32]:
df2 = df2.dropna()
df2

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3275,I Still See You,LGF,1400.0,1500000,2018
3286,The Catcher Was a Spy,IFC,725000.0,229000,2018
3309,Time Freak,Grindstone,10000.0,256000,2018
3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200,2018
3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000,2018

In [33]:
#third dataframe
df2.isna().sum()

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

## Combining Dataframes

In [34]:
#merging df(first dataframe) and df1(second dataframe) based on a common key
#setting the 'tconst' column in df and df1 as the index_column
df.set_index('tconst', inplace=True)
df.head()

,primary_title,original_title,start_year,genres
tconst,,,,
tt0063540,Sunghursh,Sunghursh,2013,"Action,Crime,Drama"
tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,"Biography,Drama"
tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,Drama
tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,"Comedy,Drama"
tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,"Comedy,Drama,Fantasy"

In [35]:
df1.set_index('tconst', inplace=True)
df1.head()

            averagerating  numvotes
tconst
tt10356526            8.3        31
tt10384606            8.9       559
tt1042974             6.4        20
tt1043726             4.2     50352
tt1060240             6.5        21

In [36]:
df_df1 = df.join(df1, how='inner')
df_df1.head()

,primary_title,original_title,start_year,genres,averagerating,numvotes
tconst,,,,,,
tt0063540,Sunghursh,Sunghursh,2013,"Action,Crime,Drama",7.0,77
tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,"Biography,Drama",7.2,43
tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,Drama,6.9,4517
tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,"Comedy,Drama",6.1,13
tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,"Comedy,Drama,Fantasy",6.5,119